-- 시설
insert into facilities values
(1, 2, 5, 200, '대구오페라하우스 본관'),
(2, 1, 5, 100, '대구오페라하우스 별관');

-- 공연
insert into performance values
('P19001', '한헝 수교 30주년 기념 공연 오페라 콘체르탄테 <반크 반>', 'A', 160, '19:00', '2019-01-17', '2019-01-17', 1, null),
('P19002', '무대점검 및 공사', 'E', null, null, '2019-01-18', '2019-02-06', 1, null),
('P19003', '렉처오페라 <버섯피자>', 'A', 80, '19:30', '2019-02-22', '2019-02-22', 1, null),
('P19004', '렉처오페라 <버섯피자>', 'A', 80, '15:00', '2019-02-23', '2019-02-23', 1, null),
('P19005', '오페라 유니버시아드<마술피리>', 'A', 150, '19:30', '2019-03-07', '2019-03-07', 1, null),
('P19006', '오페라 유니버시아드<마술피리>', 'A', 150, '19:30', '2019-03-08', '2019-03-08', 1, null),
('P19007', '오페라 유니버시아드<마술피리>', 'A', 150, '15:00', '2019-03-09', '2019-03-09', 1, null),
('P19008', '영아티스트 오페라 <사랑의 묘약>', 'A', 150, '19:30', '2019-03-29', '2019-03-29', 1, null),
('P19009', '영아티스트 오페라 <사랑의 묘약>', 'A', 150, '15:00', '2019-03-30', '2019-03-30', 1, null),
('P19010', '오페라 <팔리아치>', 'A', 90, '19:30', '2019-04-26', '2019-04-26', 1, null),
('P19011', '오페라 <팔리아치>', 'A', 90, '15:00', '2019-04-27', '2019-04-27', 1, null),
('P19012', '가족오페라 <헨젤과 그레텔>', 'A', 90, '19:30', '2019-05-24', '2019-05-24', 1, null),
('P19013', '가족오페라 <헨젤과 그레텔>', 'A', 90, '15:00', '2019-05-25', '2019-05-25', 1, null),
('P19014', '제5회 DIMF 뮤지컬스타 본선', 'B', null, '14:00', '2019-06-01', '2019-06-01', 1, null),
('P19015', '모나코 몬테카를로 발레단 <신데렐라>', 'A', 120, '15:00', '2019-06-08', '2019-06-08', 1, null),
('P19016', '모나코 몬테카를로 발레단 <신데렐라>', 'A', 120, '17:00', '2019-06-09', '2019-06-09', 1, null),
('P19017', '제 13회 대구국제뮤지컬페스티벌', 'B', null, null, '2019-06-14', '2019-07-09', 1, null);

-- 좌석
insert into seat values
('SEAT1', '1BL', 1, 1, 10), ('SEAT1', '1BR', 1, 1, 10),
('SEAT1', '1A', 1, 1, 30), ('SEAT1', '1B', 1, 1, 60), ('SEAT1', '1C', 1, 1, 30),
('SEAT2', '1BL', 1, 1, 10), ('SEAT2', '1BR', 1, 1, 10), 
('SEAT2', '1A', 1, 1, 30), ('SEAT2', '1B', 1, 1, 60), ('SEAT2', '1C', 1, 1, 30),
('SEAT3', '1BL', 1, 1, 10), ('SEAT3', '1BR', 1, 1, 10), 
('SEAT3', '1A', 1, 1, 30), ('SEAT3', '1B', 1, 1, 60), ('SEAT3', '1C', 1, 1, 30),
('SEAT1', '2BL', 1, 1, 10), ('SEAT1', '2BR', 1, 1, 10),
('SEAT1', '2A', 1, 1, 10), ('SEAT1', '2B', 1, 1, 20), ('SEAT1', '2C', 1, 1, 10),
('SEAT2', '2BL', 1, 1, 10), ('SEAT2', '2BR', 1, 1, 10), 
('SEAT2', '2A', 1, 1, 10), ('SEAT2', '2B', 1, 1, 20), ('SEAT2', '2C', 1, 1, 10),
('SEAT3', '2BL', 1, 1, 10), ('SEAT3', '2BR', 1, 1, 10), 
('SEAT3', '2A', 1, 1, 10), ('SEAT3', '2B', 1, 1, 20), ('SEAT3', '2C', 1, 1, 10);

-- 할인
insert into discount values
('00', 10, '대구오페라하우스 홈페이지 회원'), ('01', 20, '문화패스(청소년 및 대학생 8세~24세'),
('02', 30, '100인 이상'), ('03', 50, '만 65세 이상(본인)'),
('10', 20, '아이조아 카드 소지자'), ('11', 30, '대구오페라하우스 후원회');

-- 결제
insert into payment values
('PAY01', '신용카드'), ('PAY02', '무통장입금'), ('PAY03', '휴대폰결제');

-- 관리자
insert into manager values
('M1901', '홍길동');

-- 고객
insert into customer values
('C1901', '김보민', 'bmkim621', password('qwerty1234'), 'test@gmail.com', '010-123-1234', '1991-06-21', '대구광역시');
